report1000_30sec/statistics.json
{
  "Delete character" : {
    "transaction" : "Delete character",
    "sampleCount" : 38369,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 63.14628997367661,
    "medianResTime" : 73.0,
    "minResTime" : 0.0,
    "maxResTime" : 858.0,
    "pct1ResTime" : 89.0,
    "pct2ResTime" : 108.0,
    "pct3ResTime" : 235.9800000000032,
    "throughput" : 1259.403925687652,
    "receivedKBytesPerSec" : 360.3567873305488,
    "sentKBytesPerSec" : 225.0692562508206
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 193872,
    "errorCount" : 397,
    "errorPct" : 0.20477429,
    "meanResTime" : 152.647277585211,
    "medianResTime" : 83.0,
    "minResTime" : 0.0,
    "maxResTime" : 26950.0,
    "pct1ResTime" : 97.0,
    "pct2ResTime" : 126.0,
    "pct3ResTime" : 11680.0,
    "throughput" : 5934.251606978879,
    "receivedKBytesPerSec" : 39990.89112598523,
    "sentKBytesPerSec" : 1086.5534487871134
  },
  "Get all characters" : {
    "transaction" : "Get all characters",
    "sampleCount" : 39244,
    "errorCount" : 397,
    "errorPct" : 1.0116196,
    "meanResTime" : 387.1975843441051,
    "medianResTime" : 74.0,
    "minResTime" : 1.0,
    "maxResTime" : 26950.0,
    "pct1ResTime" : 92.0,
    "pct2ResTime" : 163.0,
    "pct3ResTime" : 18041.0,
    "throughput" : 1283.196547101331,
    "receivedKBytesPerSec" : 41358.678189782724,
    "sentKBytesPerSec" : 195.99027901530263
  },
  "Update character" : {
    "transaction" : "Update character",
    "sampleCount" : 38506,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 62.971874513063206,
    "medianResTime" : 73.0,
    "minResTime" : 0.0,
    "maxResTime" : 859.0,
    "pct1ResTime" : 89.0,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 230.0,
    "throughput" : 1263.4860217876362,
    "receivedKBytesPerSec" : 333.1457284010369,
    "sentKBytesPerSec" : 272.68594806158944
  },
  "Get character by id" : {
    "transaction" : "Get character by id",
    "sampleCount" : 39124,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 181.96140476433882,
    "medianResTime" : 74.0,
    "minResTime" : 0.0,
    "maxResTime" : 13807.0,
    "pct1ResTime" : 91.0,
    "pct2ResTime" : 139.0,
    "pct3ResTime" : 11679.0,
    "throughput" : 1199.4604206266479,
    "receivedKBytesPerSec" : 309.23588969280763,
    "sentKBytesPerSec" : 186.2443426558955
  },
  "Create character" : {
    "transaction" : "Create character",
    "sampleCount" : 38629,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 62.961453830023764,
    "medianResTime" : 73.0,
    "minResTime" : 0.0,
    "maxResTime" : 860.0,
    "pct1ResTime" : 89.0,
    "pct2ResTime" : 106.0,
    "pct3ResTime" : 230.0,
    "throughput" : 1265.3629454926624,
    "receivedKBytesPerSec" : 341.0548564023192,
    "sentKBytesPerSec" : 270.6196143192315
  }
}