report_stepping/statistics.json
{
  "Delete character" : {
    "transaction" : "Delete character",
    "sampleCount" : 2134,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.191658856607311,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 161.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 10.0,
    "throughput" : 11.158461659128344,
    "receivedKBytesPerSec" : 3.192802017699809,
    "sentKBytesPerSec" : 2.266562524510445
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 6501,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.768650976772799,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 778.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 13.0,
    "throughput" : 33.14013060300662,
    "receivedKBytesPerSec" : 9.069824156522248,
    "sentKBytesPerSec" : 7.52489329085677
  },
  "Update character" : {
    "transaction" : "Update character",
    "sampleCount" : 2170,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.4640552995391696,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 216.0,
    "pct1ResTime" : 3.0,
    "pct2ResTime" : 4.0,
    "pct3ResTime" : 13.289999999999964,
    "throughput" : 11.2290942208975,
    "receivedKBytesPerSec" : 2.9717622401008033,
    "sentKBytesPerSec" : 2.697614431973423
  },
  "Create character" : {
    "transaction" : "Create character",
    "sampleCount" : 2197,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.629949931725084,
    "medianResTime" : 2.0,
    "minResTime" : 0.0,
    "maxResTime" : 778.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 16.019999999999982,
    "throughput" : 11.258237422237709,
    "receivedKBytesPerSec" : 3.045441177695162,
    "sentKBytesPerSec" : 2.6716325132849255
  }
}