report_ultimate/statistics.json
{
  "Delete character" : {
    "transaction" : "Delete character",
    "sampleCount" : 280,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2.8964285714285705,
    "medianResTime" : 3.0,
    "minResTime" : 1.0,
    "maxResTime" : 24.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 18.189999999999998,
    "throughput" : 2.625164072754547,
    "receivedKBytesPerSec" : 0.7511455794112132,
    "sentKBytesPerSec" : 0.5332364522782674
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 880,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.3306818181818194,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 6.0,
    "pct3ResTime" : 18.18999999999994,
    "throughput" : 7.667174907427576,
    "receivedKBytesPerSec" : 2.0968334785449794,
    "sentKBytesPerSec" : 1.7437309409714659
  },
  "Update character" : {
    "transaction" : "Update character",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.1266666666666656,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 51.0,
    "pct1ResTime" : 4.0,
    "pct2ResTime" : 5.0,
    "pct3ResTime" : 15.970000000000027,
    "throughput" : 2.6621469327630423,
    "receivedKBytesPerSec" : 0.7045330261511566,
    "sentKBytesPerSec" : 0.6395392045504965
  },
  "Create character" : {
    "transaction" : "Create character",
    "sampleCount" : 300,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3.9399999999999986,
    "medianResTime" : 3.0,
    "minResTime" : 0.0,
    "maxResTime" : 58.0,
    "pct1ResTime" : 5.0,
    "pct2ResTime" : 7.0,
    "pct3ResTime" : 30.88000000000011,
    "throughput" : 2.6603527627763444,
    "receivedKBytesPerSec" : 0.7196462063369603,
    "sentKBytesPerSec" : 0.631314181010402
  }
}